site.org
#+HUGO_BASE_DIR: .
#+MACRO: uva @@hugo:{{<UVa2 number="$1" >}}@@


** Traveling Sales Person
:PROPERTIES:
:EXPORT_FILE_NAME: tsp
:EXPORT_DATE: 2023-03-22
:ID:       d7d4e811-1f15-42ca-b44c-fd51153aa8e1
:END:

The Traveling Salesperson Problem (TSP) is a well-known problem in computer science and operations research that asks
for the shortest possible route that visits every city exactly once and returns to the starting city.  TSP has many
practical applications, including in logistics, transportation planning, and circuit board design.

*** Materials

- [[/handouts/tsp-handout.pdf][Handout]]
- [[/slides/tsp-slides.pdf][Slides]]

