content/lectures/tsp.md
+++
title = "Traveling Sales Person"
author = ["Mattox Beckman"]
date = 2023-03-22
draft = false
+++

The Traveling Salesperson Problem (TSP) is a well-known problem in computer science and operations research that asks
for the shortest possible route that visits every city exactly once and returns to the starting city.  TSP has many
practical applications, including in logistics, transportation planning, and circuit board design.


## Materials {#materials}

-   [Handout](/handouts/tsp-handout.pdf)
-   [Slides](/slides/tsp-slides.pdf)
